content/posts/Epistemology_An_introduction_to_the_theory_of_knowledge_by_Nicholas_Rescher_in_2003.md
+++
title = "Epistemology An introduction to the theory of knowledge by Nicholas Rescher in 2003"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:20-04:00
slug = "Epistemology_An_introduction_to_the_theory_of_knowledge_by_Nicholas_Rescher_in_2003"
draft = false
+++

## [philosophy]({{< relref "philosophy" >}}), [pragmatism]({{< relref "pragmatism" >}}), [Nicholas Rescher]({{< relref "Nicholas_Rescher" >}}), [books]({{< relref "books" >}}) {#philosophy--philosophy-dot-md--pragmatism--pragmatism-dot-md--nicholas-rescher--nicholas-rescher-dot-md--books--books-dot-md}


## citations {#citations}


### p. 120 of [Intelligence and spirit by Reza Negarestani in 2018]({{< relref "Intelligence_and_spirit_by_Reza_Negarestani_in_2018" >}}) {#p-dot-120-of-intelligence-and-spirit-by-reza-negarestani-in-2018--intelligence-and-spirit-by-reza-negarestani-in-2018-dot-md}


## contents {#contents}


### I. Knowledge and its problems {#i-dot-knowledge-and-its-problems}

<!--list-separator-->

-  1. Modes of knowledge

<!--list-separator-->

-  2. Fallibilism and truth estimation

<!--list-separator-->

-  3. Skepticism and its deficits

<!--list-separator-->

-  4. Epistemic justification in a functionalistic and naturalistic perspective

<!--list-separator-->

-  5. Plausibility and presumption

<!--list-separator-->

-  6. Trust and cooperation in pragmatic perspective


### II. Rational inquiry and the quest for truth {#ii-dot-rational-inquiry-and-the-quest-for-truth}

<!--list-separator-->

-  7. Foundationalism versus coherentism

<!--list-separator-->

-  8. The pursuit of truth: Coherentist Criteriology

    <!--list-separator-->

    -  SYNOPSIS

        <!--list-separator-->

        -  Coherentism bases its criteriology of truth in “coherence,” that is, on cognitive systematicity. But what is it that gets systematized?

        <!--list-separator-->

        -  The answer here lies in the idea of data—claims that are substantially plausible in the epistemic circumstances at issue, not certified truths but promising truth-candidates.

        <!--list-separator-->

        -  The ultimate validation of a coherentist approach to truth assessment lies in the pragmatic utility of its results. For in the end it is the efficacy of its applications—alike in theoretical and practical matters—that serves as the arbiter of our cognition—the controlling monitor of adequacy for truth-estimation.

        <!--list-separator-->

        -  The idea of truth with regard to general matters of fact as we deal with them in science is in fact something of an idealization.

        <!--list-separator-->

        -  It is not the accomplished product of current inquiry but the hypothesized product of idealized inquiry. The idea of truth as idealized coherence accordingly provides a cogent specification for the nature of truth.

<!--list-separator-->

-  9. Cognitive relativism and contextualism

<!--list-separator-->

-  10. The pragmatic rationale of cognitive objectivity

<!--list-separator-->

-  11. Rationality


### III. Cognitive progress {#iii-dot-cognitive-progress}

<!--list-separator-->

-  12. Scientific progress

<!--list-separator-->

-  13. The law of logarithmic returns and the complexification of natural science

    <!--list-separator-->

    -  13.1 The principle of least effort and the methodological status of simplicity-preference in science

    <!--list-separator-->

    -  13.2 Complexification [key subsection]({{< relref "key_subsection" >}})

        <!--list-separator-->

        -  See the quotation of this in [Intelligence and spirit by Reza Negarestani in 2018]({{< relref "Intelligence_and_spirit_by_Reza_Negarestani_in_2018" >}}) p. 120

            For rational beings will of course try simple things first and thereafter be driven step by step toward an ever-enhanced complexifi\* cation. In the course of rational inquiry we try the simple solutions first, and only thereafter, if and when they cease to work—when they are ruled out by fur\* ther findings (by some further influx of coordinating information)—do we move on to the more complex.Things go along smoothly until an oversimple solution becomes destabilized by enlarged experience. For a time we get by with the comparatively simpler options—until the expanding information about the world’s modus operandi made possible by enhanced new means of observation and experimentation insists otherwise. And with the expansion of knowledge those new accessions make ever increasing demands. And so evolution, be it nat\* ural or rational—whether of animal species or of literary genres—ongoingly confronts us with products of greater and greater complexity.

    <!--list-separator-->

    -  13.3 The expansion of science

    <!--list-separator-->

    -  13.4 The law of logarithmic returns

    <!--list-separator-->

    -  13.5 The rationale and implications of the law of logarithmic returns

    <!--list-separator-->

    -  13.6 The growth of knowledge

    <!--list-separator-->

    -  13.7 The deceleration of scientific progress

    <!--list-separator-->

    -  13.8 Predictive implications of the information/knowledge relationship

    <!--list-separator-->

    -  13.9 The centrality of quality and its implications

<!--list-separator-->

-  14. The imeperfectability of knowledge: knowledge as boundless


### IV. Cognitive limits and the quest for truth {#iv-dot-cognitive-limits-and-the-quest-for-truth}

<!--list-separator-->

-  15. The rational intelligibility of nature

<!--list-separator-->

-  16. Human science as characteristically human

<!--list-separator-->

-  17. On ignorance, insolubilia, and the limits of knowledge

<!--list-separator-->

-  18. Cognitive realism

    <!--list-separator-->

    -  18.1 Existence

    <!--list-separator-->

    -  18.2 Is man the measure? Homo mensura?

    <!--list-separator-->

    -  18.3 Realism and incapacity

    <!--list-separator-->

    -  18.4 The cognitive opacity of real things

    <!--list-separator-->

    -  18.5 The cognitive inexhaustibility of things

    <!--list-separator-->

    -  18.6 The corrigibility of conceptions

    <!--list-separator-->

    -  18.7 The cognitive inexhaustibility of things

    <!--list-separator-->

    -  18.8 Cognitive dynamics

    <!--list-separator-->

    -  18.9 Conceptual basis of realism as a postulate

    <!--list-separator-->

    -  18.10 Hidden depths: the impetus to realism

    <!--list-separator-->

    -  18.11 The pragmatic foundation of realism as a basis for communication and discourse

    <!--list-separator-->

    -  18.12 The idealistic aspect of metaphysical realism

    <!--list-separator-->

    -  18.13 Science and reality
